Reports/ОтчетПоПродажам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Report>
		<Properties>
			<Name>ОтчетПоПродажам</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ПродажиФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиФакт</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродажи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ОтчетПоПродажам/Ext/ManagerModule.bsl
Функция СформироватьОтчет(ПериодОтчета, СписокПодразделений) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ОтчетПоПродажам.ПолучитьМакет("Макет");
	ОбластьЗаголовок =  Макет.ПолучитьОбласть("Заголовок");
	ОбластьНаименованиеПоказателя = Макет.ПолучитьОбласть("НаименованиеПоказателя");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаГод = Макет.ПолучитьОбласть("Строка | ГодКолонка");
	ОбластьСтрокаМесяц = Макет.ПолучитьОбласть("Строка | МесяцКолонка");
	
	Если ПериодОтчета.ДатаОкончания = Дата("01.01.0001 0:00:00") Тогда
		ПериодОтчета.ДатаОкончания = Дата("31.12.2099 23:59:59");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиФактОбороты.Период КАК ПериодМесяц,
	|	ПродажиФактОбороты.ВидПродажи КАК Показатель,
	|	СУММА(ЕСТЬNULL(ПродажиФактОбороты.СуммаОборот, 0)) КАК Значение,
	|	ГОД(ПродажиФактОбороты.Период) КАК ПериодГод
	|ИЗ
	|	РегистрНакопления.ПродажиФакт.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, Подразделение В (&СписокПодразделений)) КАК ПродажиФактОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиФактОбороты.Период,
	|	ПродажиФактОбороты.ВидПродажи
	|
	|УПОРЯДОЧИТЬ ПО
	|	Показатель,
	|	ПериодМесяц,
	|	ПериодГод
	|ИТОГИ ПО
	|	Показатель,
	|	ПериодГод,
	|	ПериодМесяц ПЕРИОДАМИ(МЕСЯЦ, &ДатаНачала, &ДатаОкончания) КАК ПериодМесяц";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ПериодОтчета.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецГода(ПериодОтчета.ДатаОкончания));
	Если СписокПодразделений.Количество() = 1 и (СписокПодразделений[0].Значение = Неопределено или СписокПодразделений[0].Значение = Справочники.Подразделения.ПустаяСсылка()) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подразделение В (&СписокПодразделений)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультатов = РезультатЗапроса.Выгрузить();
	ВыборкаПоказатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Показатель");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Пока ВыборкаПоказатель.Следующий() Цикл
		
		ОбластьНаименованиеПоказателя.Параметры.НаименованиеПоказателя = ВыборкаПоказатель.Показатель;
		ТабДок.Вывести(ОбластьНаименованиеПоказателя);
		
		ПериодГод = ВыборкаПоказатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодГод", "ВСЕ");
		ТабДок.Вывести(ОбластьШапка);
		
		Пока ПериодГод.Следующий() Цикл
			
			ПострочныйРезультат = 0;
			Счетчик = 0;
			
			ОбластьСтрокаГод.Параметры.Год = Формат(ПериодГод.ПериодГод,"ЧГ=");
			ТабДок.Вывести(ОбластьСтрокаГод);
			
			ПериодМесяц = ПериодГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодМесяц", "ВСЕ");
			
			Пока ПериодМесяц.Следующий() Цикл
				
				Если ПериодГод.ПериодГод = Число( Формат(ПериодМесяц.ПериодМесяц,"ДФ=гггг")) Тогда
					
					Счетчик = Счетчик +1;
					ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = ПериодМесяц.Значение;
					ОбластьСтрокаМесяц.Параметры.РасшифровкаПоказателя = Новый Структура("Период, ЗначениеПоказателя, Показатель, СписокПодразделений", ПериодМесяц.ПериодМесяц, ПериодМесяц.Значение, ВыборкаПоказатель.Показатель, СписокПодразделений);
					ТабДок.Присоединить(ОбластьСтрокаМесяц);
					ПострочныйРезультат = ПострочныйРезультат + ?(ЗначениеЗаполнено(ПериодМесяц.Значение), ПериодМесяц.Значение, 0);
					Если Счетчик = 12 Тогда
						ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = ПострочныйРезультат;
						ТабДок.Присоединить(ОбластьСтрокаМесяц);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
